{"config": [{"config": {"name": "conv2d_5", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "batch_input_shape": [null, 64, 64, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "padding": "valid", "bias_constraint": null, "filters": 32, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_5", "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_6", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "padding": "valid", "bias_constraint": null, "filters": 64, "strides": [1, 1], "use_bias": true, "trainable": true, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_6", "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_7", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "padding": "valid", "bias_constraint": null, "filters": 64, "strides": [1, 1], "use_bias": true, "trainable": true, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_7", "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_8", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "padding": "valid", "bias_constraint": null, "filters": 64, "strides": [1, 1], "use_bias": true, "trainable": true, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_8", "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 128, "name": "dense_5", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "class_name": "Activation"}, {"config": {"units": 128, "name": "dense_6", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "class_name": "Activation"}, {"config": {"units": 128, "name": "dense_7", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "class_name": "Activation"}, {"config": {"noise_shape": null, "rate": 0.5, "name": "dropout_2", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"units": 8, "name": "dense_8", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "trainable": true}, "class_name": "Dense"}], "keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow"}